Confirmed with all vars set to default that this plan runs successfully:
```
terraform apply
random_id.uniq: Refreshing state... [id=dWWICg]
data.google_project.selected: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account.lacework[0] will be created
  + resource "google_service_account" "lacework" {
      + account_id   = "lwsvc-7565880a"
      + display_name = "lwsvc-7565880a"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "lacework-ecosystem2"
      + unique_id    = (known after apply)
    }

  # google_service_account_key.lacework[0] will be created
  + resource "google_service_account_key" "lacework" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_service_account.lacework[0]: Creating...
google_service_account.lacework[0]: Creation complete after 2s [id=projects/lacework-ecosystem2/serviceAccounts/lwsvc-7565880a@lacework-ecosystem2.iam.gserviceaccount.com]
google_service_account_key.lacework[0]: Creating...
google_service_account_key.lacework[0]: Creation complete after 2s [id=projects/lacework-ecosystem2/serviceAccounts/lwsvc-7565880a@lacework-ecosystem2.iam.gserviceaccount.com/keys/2424429b9190986b85b79e28ba27de882700e3eb]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

Outputs:

created = true
name =
private_key = .....
project_id = lacework-ecosystem2
```